#Generated by Design Compiler(M-2016.12-SP2) on Mon Aug 21 17:10:42 2017

if {[info exists synopsys_program_name]} {
set_design_attributes -elements {.} -attribute lower_domain_boundary false
}
set_design_attributes -elements {.} -attribute enable_state_propagation_in_add_power_state true
create_supply_set SS 
create_supply_set SSL 
create_supply_set SSL_SIPO_SW 
create_supply_set SSL_PISO_SW 
create_supply_set SS_MEM_SW 
create_power_domain TOP -include_scope -supply {primary SS}
create_power_domain PD_SIPO -elements sipo_bit -supply {primary SSL_SIPO_SW}
create_power_domain PD_PISO -elements piso_bit -supply {primary SSL_PISO_SW}
create_power_switch PD1_SW -domain PD_SIPO -output_supply_port {out SSL_SIPO_SW.power} -input_supply_port {in SSL.power} -control_port {shut_down_signal_SIPO shut_down_signals[0]} -on_state {TOP_ON in {!shut_down_signal_SIPO}} -ack_port {ack_signal_SIPO PG_ack_signals[0] {shut_down_signal_SIPO}} -ack_delay {ack_signal_SIPO 10}
create_power_switch PD2_SW -domain PD_PISO -output_supply_port {out SSL_PISO_SW.power} -input_supply_port {in SSL.power} -control_port {shut_down_signal_PISO shut_down_signals[1]} -on_state {TOP_ON in {!shut_down_signal_PISO}} -ack_port {ack_signal_PISO PG_ack_signals[1] {shut_down_signal_PISO}} -ack_delay {ack_signal_PISO 10}
map_power_switch PD1_SW -domain PD_SIPO -lib_cells {HEAD2X16_HVT HEAD2X2_HVT HEAD2X32_HVT HEAD2X4_HVT HEAD2X8_HVT HEAD2X16_RVT HEAD2X2_RVT HEAD2X32_RVT HEAD2X4_RVT HEAD2X8_RVT HEAD2X16_LVT HEAD2X2_LVT HEAD2X32_LVT HEAD2X4_LVT HEAD2X8_LVT}
map_power_switch PD2_SW -domain PD_PISO -lib_cells {HEAD2X16_HVT HEAD2X2_HVT HEAD2X32_HVT HEAD2X4_HVT HEAD2X8_HVT HEAD2X16_RVT HEAD2X2_RVT HEAD2X32_RVT HEAD2X4_RVT HEAD2X8_RVT HEAD2X16_LVT HEAD2X2_LVT HEAD2X32_LVT HEAD2X4_LVT HEAD2X8_LVT}
set_retention RET_SIPO -domain PD_SIPO -retention_supply_set SSL 
set_retention_control RET_SIPO -domain PD_SIPO -save_signal {retention_signals[0] high} -restore_signal {retention_signals[0] low}
set_retention RET_PISO -domain PD_PISO -retention_supply_set SSL 
set_retention_control RET_PISO -domain PD_PISO -save_signal {retention_signals[1] high} -restore_signal {retention_signals[1] low}
map_retention_cell RET_SIPO -domain PD_SIPO -lib_cells {RSDFFARX1_HVT RSDFFARX2_HVT RSDFFARX1_RVT RSDFFARX2_RVT RSDFFARX1_LVT RSDFFARX2_LVT }
map_retention_cell RET_PISO -domain PD_PISO -lib_cells {RSDFFARX1_HVT RSDFFARX2_HVT RSDFFARX1_RVT RSDFFARX2_RVT RSDFFARX1_LVT RSDFFARX2_LVT }
set_isolation ISO_SIPO_OUT -domain PD_SIPO -isolation_supply_set SS -name_suffix ISO_SIPO_OUT -clamp_value 1 -sink SS 
set_isolation_control ISO_SIPO_OUT -domain PD_SIPO -isolation_signal {isolation_signals[0]} -isolation_sense high -location parent
set_isolation ISO_SIPO2MEM_OUT -domain PD_SIPO -isolation_supply_set SS -name_suffix ISO_SIPO2MEM_OUT -clamp_value 1 -sink SS_MEM_SW 
set_isolation_control ISO_SIPO2MEM_OUT -domain PD_SIPO -isolation_signal {isolation_signals[0]} -isolation_sense high -location parent
set_isolation ISO_SIPO2MEM_OUT1 -domain PD_SIPO -isolation_supply_set SS -elements sipo_bit/wr -name_suffix ISO_SIPO2MEM_OUT1 -clamp_value 1 -sink SS_MEM_SW 
set_isolation_control ISO_SIPO2MEM_OUT1 -domain PD_SIPO -isolation_signal {isolation_signals[0]} -isolation_sense high -location fanout
set_isolation ISO_SIPO2MEM_OUT2 -domain PD_SIPO -isolation_supply_set SS -elements sipo_bit/wr -name_suffix ISO_SIPO2MEM_OUT2 -clamp_value 1 -sink SS 
set_isolation_control ISO_SIPO2MEM_OUT2 -domain PD_SIPO -isolation_signal {isolation_signals[0]} -isolation_sense high -location fanout
set_isolation ISO_PISO_OUT -domain PD_PISO -isolation_supply_set SS -name_suffix ISO_PISO_OUT -clamp_value 1 -sink SS 
set_isolation_control ISO_PISO_OUT -domain PD_PISO -isolation_signal {isolation_signals[1]} -isolation_sense high -location parent
set_isolation ISO_TOP2_MEM -domain TOP -isolation_supply_set SS -name_suffix ISO_TOP2_MEM -clamp_value 1 -source SS_MEM_SW 
set_isolation_control ISO_TOP2_MEM -domain TOP -isolation_signal {isolation_signals[1]} -isolation_sense high -location self
set_isolation ISO_PISO_OUT_SSL -domain PD_PISO -isolation_supply_set SSL -elements piso_bit/dout -name_suffix ISO_PISO_OUT_SSL -clamp_value 0 
set_isolation_control ISO_PISO_OUT_SSL -domain PD_PISO -isolation_signal {isolation_signals[1]} -isolation_sense high -location self
map_isolation_cell ISO_PISO_OUT_SSL -domain PD_PISO -lib_cells {ISO_NOR2X4_HVT ISO_NOR2X4_LVT }
add_power_state -supply SS -state SS_ON {-supply_expr {power == {FULL_ON 0.85}}}
add_power_state -supply SS -state GND {-supply_expr {ground == {FULL_ON 0.0}}}
add_power_state -supply SSL -state SSL_ON {-supply_expr {power == {FULL_ON 0.78}}}
add_power_state -supply SSL_SIPO_SW -state SSL_SIPO_ON {-supply_expr {power == {FULL_ON 0.78}}}
add_power_state -supply SSL_SIPO_SW -state SSL_SIPO_OFF {-supply_expr {power == {OFF}} -simstate CORRUPT}
add_power_state -supply SSL_PISO_SW -state SSL_PISO_ON {-supply_expr {power == {FULL_ON 0.78}}}
add_power_state -supply SSL_PISO_SW -state SSL_PISO_OFF {-supply_expr {power == {OFF}} -simstate CORRUPT}
add_power_state -supply SS_MEM_SW -state MEM_ON {-supply_expr {power == {FULL_ON 0.85}}}
add_power_state -supply SS_MEM_SW -state MEM_OFF {-supply_expr {power == {OFF}} -simstate CORRUPT}
create_pst BIT_SLICE_PST -supplies [list SS.power SSL.power SSL_SIPO_SW.power SSL_PISO_SW.power SS_MEM_SW.power SS.ground]
add_pst_state ALL_ON -pst BIT_SLICE_PST -state {SS_ON SSL_ON SSL_SIPO_ON SSL_PISO_ON MEM_ON GND}
add_pst_state PISO_ON -pst BIT_SLICE_PST -state {SS_ON SSL_ON SSL_SIPO_OFF SSL_PISO_ON MEM_ON GND}
add_pst_state SIPO_ON -pst BIT_SLICE_PST -state {SS_ON SSL_ON SSL_SIPO_ON SSL_PISO_OFF MEM_ON GND}
add_pst_state SIPO_PISO_OFF -pst BIT_SLICE_PST -state {SS_ON SSL_ON SSL_SIPO_OFF SSL_PISO_OFF MEM_ON GND}
connect_supply_net SS_MEM_SW.power -ports {nibble_0/VDDG}
connect_supply_net SS_MEM_SW.power -ports {nibble_1/VDDG}
connect_supply_net SS.power -ports {nibble_0/VDD}
connect_supply_net SS.ground -ports {nibble_0/VSS}
connect_supply_net SS.power -ports {nibble_1/VDD}
connect_supply_net SS.ground -ports {nibble_1/VSS}
create_supply_port VSS -direction in
create_supply_net VSS 
connect_supply_net VSS -ports VSS
create_supply_port VDDL -direction in
create_supply_net VDDL 
connect_supply_net VDDL -ports VDDL
create_supply_port VDDH -direction in
create_supply_net VDDH 
connect_supply_net VDDH -ports VDDH
create_supply_port VDDM -direction out
create_supply_net VDDM -resolve parallel
connect_supply_net VDDM -ports VDDM
create_supply_port piso_sw_out -direction out
create_supply_net piso_sw_out -resolve parallel
connect_supply_net piso_sw_out -ports piso_sw_out
create_supply_port sipo_sw_out -direction out
create_supply_net sipo_sw_out -resolve parallel
connect_supply_net sipo_sw_out -ports sipo_sw_out
create_supply_set SSL_PISO_SW -function {power piso_sw_out} -update
create_supply_set SSL_SIPO_SW -function {power sipo_sw_out} -update
create_supply_set SS -function {power VDDH} -update
create_supply_set SSL -function {power VDDL} -update
create_supply_set SS_MEM_SW -function {power VDDM} -update
create_supply_set SSL_SIPO_SW -function {ground VSS} -update
create_supply_set SSL_PISO_SW -function {ground VSS} -update
create_supply_set SS -function {ground VSS} -update
create_supply_set SSL -function {ground VSS} -update
create_supply_set SS_MEM_SW -function {ground VSS} -update
set_port_attributes -ports {retention_signals[1] retention_signals[0]} -driver_supply SSL
set_port_attributes -ports {isolation_signals[1] isolation_signals[0]} -driver_supply SSL
set_port_attributes -ports {sin} -driver_supply SSL
set_port_attributes -ports {lclk} -driver_supply SSL
set_port_attributes -ports {hclk} -driver_supply SS
set_port_attributes -ports {data_valid} -driver_supply SSL
set_port_attributes -ports {shut_down_signals[1] shut_down_signals[0]} -driver_supply SSL
set_port_attributes -ports {sout} -receiver_supply SSL

set derived_upf true
#Design Compiler added commands
connect_supply_net VSS -ports {snps_PD_SIPO__ISO_SIPO2MEM_OUT2_snps_wrISO_SIPO2MEM_OUT2/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_0_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_1_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_2_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_0_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_1_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_3_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_4_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_5_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_8_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_10_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_11_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_12_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_13_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_14_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_15_ISO_SIPO_OUT/VSS CLK_UPF_LS/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_3_ISO_SIPO_OUT/VSS lreset_sync/CLK_UPF_LS/VSS piso_bit/load_UPF_LS/VSS piso_bit/din_0__UPF_LS/VSS piso_bit/din_1__UPF_LS/VSS piso_bit/din_2__UPF_LS/VSS piso_bit/din_3__UPF_LS/VSS piso_bit/din_4__UPF_LS/VSS piso_bit/din_5__UPF_LS/VSS piso_bit/din_6__UPF_LS/VSS piso_bit/din_7__UPF_LS/VSS piso_bit/din_8__UPF_LS/VSS piso_bit/din_9__UPF_LS/VSS piso_bit/din_10__UPF_LS/VSS piso_bit/din_11__UPF_LS/VSS piso_bit/din_12__UPF_LS/VSS piso_bit/din_13__UPF_LS/VSS piso_bit/din_14__UPF_LS/VSS piso_bit/din_15__UPF_LS/VSS piso_bit/reset_UPF_LS/VSS sync_datafrommem/dut_sync/CLK_UPF_LS/VSS}
connect_supply_net VDDL -ports {CLK_UPF_LS/VDDL lreset_sync/CLK_UPF_LS/VDDL sync_datafrommem/dut_sync/CLK_UPF_LS/VDDL}
connect_supply_net VDDH -ports {snps_PD_SIPO__ISO_SIPO2MEM_OUT2_snps_wrISO_SIPO2MEM_OUT2/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_0_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_1_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_2_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_0_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_1_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_3_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_4_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_5_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_8_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_10_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_11_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_12_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_13_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_14_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_15_ISO_SIPO_OUT/VDDH CLK_UPF_LS/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_3_ISO_SIPO_OUT/VDDH lreset_sync/CLK_UPF_LS/VDDH sync_datafrommem/dut_sync/CLK_UPF_LS/VDDH}
connect_supply_net piso_sw_out -ports {piso_bit/load_UPF_LS/VDDL piso_bit/din_0__UPF_LS/VDDL piso_bit/din_1__UPF_LS/VDDL piso_bit/din_2__UPF_LS/VDDL piso_bit/din_3__UPF_LS/VDDL piso_bit/din_4__UPF_LS/VDDL piso_bit/din_5__UPF_LS/VDDL piso_bit/din_6__UPF_LS/VDDL piso_bit/din_7__UPF_LS/VDDL piso_bit/din_8__UPF_LS/VDDL piso_bit/din_9__UPF_LS/VDDL piso_bit/din_10__UPF_LS/VDDL piso_bit/din_11__UPF_LS/VDDL piso_bit/din_12__UPF_LS/VDDL piso_bit/din_13__UPF_LS/VDDL piso_bit/din_14__UPF_LS/VDDL piso_bit/din_15__UPF_LS/VDDL piso_bit/reset_UPF_LS/VDDL}
connect_supply_net sipo_sw_out -ports {snps_PD_SIPO__ISO_SIPO2MEM_OUT2_snps_wrISO_SIPO2MEM_OUT2/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_0_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_1_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_2_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_0_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_1_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_3_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_4_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_5_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_8_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_10_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_11_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_12_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_13_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_14_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_15_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_addr_3_ISO_SIPO_OUT/VDDL}
connect_supply_net VSS -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_scan_outISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_9_ISO_SIPO_OUT/VSS isolation_signals_0__UPF_LS/VSS EN_UPF_LS/VSS sipo_bit/scan_enable_UPF_LS/VSS sipo_bit/scan_in_UPF_LS/VSS piso_bit/scan_enable_UPF_LS/VSS piso_bit/scan_in_UPF_LS/VSS}
connect_supply_net VDDL -ports {isolation_signals_0__UPF_LS/VDDL EN_UPF_LS/VDDL}
connect_supply_net VDDH -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_scan_outISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_9_ISO_SIPO_OUT/VDDH isolation_signals_0__UPF_LS/VDDH EN_UPF_LS/VDDH}
connect_supply_net piso_sw_out -ports {piso_bit/scan_enable_UPF_LS/VDDL piso_bit/scan_in_UPF_LS/VDDL}
connect_supply_net sipo_sw_out -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_scan_outISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_9_ISO_SIPO_OUT/VDDL sipo_bit/scan_enable_UPF_LS/VDDL sipo_bit/scan_in_UPF_LS/VDDL}
connect_supply_net VSS -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_2_ISO_SIPO_OUT/VSS}
connect_supply_net VDDH -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_2_ISO_SIPO_OUT/VDDH}
connect_supply_net sipo_sw_out -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_2_ISO_SIPO_OUT/VDDL}
connect_supply_net VSS -ports {snps_PD_PISO__ISO_PISO_OUT_snps_scan_outISO_PISO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_6_ISO_SIPO_OUT/VSS snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_7_ISO_SIPO_OUT/VSS sipo_bit/reset_UPF_LS/VSS}
connect_supply_net VDDH -ports {snps_PD_PISO__ISO_PISO_OUT_snps_scan_outISO_PISO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_6_ISO_SIPO_OUT/VDDH snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_7_ISO_SIPO_OUT/VDDH}
connect_supply_net piso_sw_out -ports {snps_PD_PISO__ISO_PISO_OUT_snps_scan_outISO_PISO_OUT/VDDL}
connect_supply_net sipo_sw_out -ports {snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_6_ISO_SIPO_OUT/VDDL snps_PD_SIPO__ISO_SIPO_OUT_snps_pout_7_ISO_SIPO_OUT/VDDL sipo_bit/reset_UPF_LS/VDDL}
connect_supply_net VDDL -ports {sipo_bit/U40/VDDG sipo_bit/U72/VDDG sipo_bit/U33/VDDG sipo_bit/U70/VDDG sipo_bit/U71/VDDG sipo_bit/U73/VDDG sipo_bit/U28/VDDG sipo_bit/U74/VDDG piso_bit/U20/VDDG piso_bit/U4/VDDG}
set derived_upf false

