#Generated by Design Compiler(M-2016.12-SP2) on Mon Aug 21 17:22:19 2017

if {[info exists synopsys_program_name]} {
set_design_attributes -elements {.} -attribute lower_domain_boundary false
}
set_design_attributes -elements {. slice_31 slice_30 slice_29 slice_28 slice_27 slice_26 slice_25 slice_24 slice_23 slice_22 slice_21 slice_20 slice_19 slice_18 slice_17 slice_16 slice_15 slice_14 slice_13 slice_12 slice_11 slice_10 slice_9 slice_8 slice_7 slice_6 slice_5 slice_4 slice_3 slice_2 slice_1 slice_0} -attribute enable_state_propagation_in_add_power_state true
create_power_domain TOP -include_scope
create_power_domain PD_SIPO_SLICE -elements {sipo_slice_first sipo_slice_last}
create_power_domain PD_PISO_SLICE -elements {piso_slice_last piso_slice_first}
create_supply_net piso_sw_out -resolve parallel
create_supply_net sipo_sw_out -resolve parallel
create_supply_net VSS 
create_supply_net VDDL 
create_supply_net VDDH 
create_supply_net VDDM -resolve parallel
create_supply_set SS 
create_supply_set SSL -function {power VDDL} -function {ground VSS} 
create_supply_set SSL_SIPO_SLICE_SW 
create_supply_set SSL_PISO_SLICE_SW 
create_supply_set SS_MEM_SW -function {power VDDM} -function {ground VSS} 
create_supply_set SS -function {power VDDH} -function {ground VSS} -update
create_supply_set SSL_SIPO_SLICE_SW -function {power sipo_sw_out} -function {ground VSS} -update
create_supply_set SSL_PISO_SLICE_SW -function {power piso_sw_out} -function {ground VSS} -update
associate_supply_set SS -handle TOP.primary
associate_supply_set SSL_SIPO_SLICE_SW -handle PD_SIPO_SLICE.primary
associate_supply_set SSL_PISO_SLICE_SW -handle PD_PISO_SLICE.primary
add_power_state -supply SS -state SS_ON {-supply_expr {power == {FULL_ON 0.85}}}
add_power_state -supply SS -state GND {-supply_expr {ground == {FULL_ON 0.0}}}
add_power_state -supply SSL -state SSL_ON {-supply_expr {power == {FULL_ON 0.78}}}
add_power_state -supply SSL_SIPO_SLICE_SW -state SSL_SIPO_SLICE_ON {-supply_expr {power == {FULL_ON 0.78}}}
add_power_state -supply SSL_SIPO_SLICE_SW -state SSL_SIPO_SLICE_OFF {-supply_expr {power == {OFF}} -simstate CORRUPT}
add_power_state -supply SSL_PISO_SLICE_SW -state SSL_PISO_SLICE_ON {-supply_expr {power == {FULL_ON 0.78}}}
add_power_state -supply SSL_PISO_SLICE_SW -state SSL_PISO_SLICE_OFF {-supply_expr {power == {OFF}} -simstate CORRUPT}
add_power_state -supply SS_MEM_SW -state MEM_ON {-supply_expr {power == {FULL_ON 0.85}}}
add_power_state -supply SS_MEM_SW -state MEM_OFF {-supply_expr {power == {OFF}} -simstate CORRUPT}
create_supply_port piso_sw_out -direction out
create_supply_port sipo_sw_out -direction out
create_supply_port VSS -direction in
create_supply_port VDDL -direction in
create_supply_port VDDH -direction in
create_supply_port VDDM -direction out
connect_supply_net piso_sw_out -ports [list piso_sw_out slice_0/piso_sw_out slice_1/piso_sw_out slice_2/piso_sw_out slice_3/piso_sw_out slice_4/piso_sw_out slice_5/piso_sw_out slice_6/piso_sw_out slice_7/piso_sw_out slice_8/piso_sw_out slice_9/piso_sw_out slice_10/piso_sw_out slice_11/piso_sw_out slice_12/piso_sw_out slice_13/piso_sw_out slice_14/piso_sw_out slice_15/piso_sw_out slice_16/piso_sw_out slice_17/piso_sw_out slice_18/piso_sw_out slice_19/piso_sw_out slice_20/piso_sw_out slice_21/piso_sw_out slice_22/piso_sw_out slice_23/piso_sw_out slice_24/piso_sw_out slice_25/piso_sw_out slice_26/piso_sw_out slice_27/piso_sw_out slice_28/piso_sw_out slice_29/piso_sw_out slice_30/piso_sw_out slice_31/piso_sw_out]
connect_supply_net piso_sw_out -ports {snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_doutISO_PISO_OUT/VDDL snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_dout_0_ISO_PISO_OUT/VDDL snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_scan_out5ISO_PISO_OUT/VDDL}
connect_supply_net piso_sw_out -ports {piso_slice_first/load_UPF_LS/VDDL piso_slice_first/reset_UPF_LS/VDDL piso_slice_first/scan_enable_UPF_LS/VDDL piso_slice_last/load_UPF_LS/VDDL piso_slice_last/reset_UPF_LS/VDDL piso_slice_last/scan_enable_UPF_LS/VDDL}
connect_supply_net piso_sw_out -ports {U146/VDDG U103/VDDG U140/VDDG U124/VDDG U178/VDDG U99/VDDG U145/VDDG U157/VDDG U167/VDDG U123/VDDG U115/VDDG U180/VDDG U168/VDDG U148/VDDG U147/VDDG U116/VDDG U100/VDDG U96/VDDG U91/VDDG U87/VDDG}
connect_supply_net piso_sw_out -ports {U158/VDDG U137/VDDG U117/VDDG U132/VDDG U125/VDDG U154/VDDG U176/VDDG U165/VDDG U182/VDDG U149/VDDG U141/VDDG U138/VDDG U143/VDDG U85/VDDG U142/VDDG U131/VDDG U164/VDDG U134/VDDG U181/VDDG U175/VDDG U174/VDDG U159/VDDG U169/VDDG U152/VDDG U160/VDDG U166/VDDG U156/VDDG U170/VDDG U89/VDDG}
connect_supply_net piso_sw_out -ports {U120/VDDG U162/VDDG U114/VDDG U127/VDDG U130/VDDG U151/VDDG U112/VDDG}
connect_supply_net sipo_sw_out -ports [list sipo_sw_out slice_0/sipo_sw_out slice_1/sipo_sw_out slice_2/sipo_sw_out slice_3/sipo_sw_out slice_4/sipo_sw_out slice_5/sipo_sw_out slice_6/sipo_sw_out slice_7/sipo_sw_out slice_8/sipo_sw_out slice_9/sipo_sw_out slice_10/sipo_sw_out slice_11/sipo_sw_out slice_12/sipo_sw_out slice_13/sipo_sw_out slice_14/sipo_sw_out slice_15/sipo_sw_out slice_16/sipo_sw_out slice_17/sipo_sw_out slice_18/sipo_sw_out slice_19/sipo_sw_out slice_20/sipo_sw_out slice_21/sipo_sw_out slice_22/sipo_sw_out slice_23/sipo_sw_out slice_24/sipo_sw_out slice_25/sipo_sw_out slice_26/sipo_sw_out slice_27/sipo_sw_out slice_28/sipo_sw_out slice_29/sipo_sw_out slice_30/sipo_sw_out slice_31/sipo_sw_out]
connect_supply_net sipo_sw_out -ports {U249/VDDG U237/VDDG U230/VDDG U219/VDDG U235/VDDG U245/VDDG U136/VDDG}
connect_supply_net sipo_sw_out -ports {U233/VDDG U247/VDDG U243/VDDG U241/VDDG U248/VDDG U218/VDDG U217/VDDG U252/VDDG U224/VDDG U238/VDDG U228/VDDG U232/VDDG U216/VDDG U244/VDDG U250/VDDG U240/VDDG U226/VDDG U239/VDDG U287/VDDG U231/VDDG U223/VDDG U221/VDDG U242/VDDG U229/VDDG U234/VDDG U290/VDDG U236/VDDG U246/VDDG U139/VDDG U172/VDDG U289/VDDG U150/VDDG}
connect_supply_net sipo_sw_out -ports {U227/VDDG U220/VDDG U222/VDDG U251/VDDG U225/VDDG}
connect_supply_net sipo_sw_out -ports {snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_0__0_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_wrISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_1_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_2_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_wr_0_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_1__0_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_0_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_3__0_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_3_ISO_SIPO_OUT/VDDL snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_2__0_ISO_SIPO_OUT/VDDL}
connect_supply_net sipo_sw_out -ports {sipo_slice_first/sin_UPF_LS/VDDL sipo_slice_first/scan_in1_UPF_LS/VDDL sipo_slice_first/reset_UPF_LS/VDDL sipo_slice_first/scan_enable_UPF_LS/VDDL sipo_slice_last/sin_UPF_LS/VDDL sipo_slice_last/scan_enable_UPF_LS/VDDL sipo_slice_last/reset_UPF_LS/VDDL}
connect_supply_net VSS -ports [list VSS slice_0/VSS slice_1/VSS slice_2/VSS slice_3/VSS slice_4/VSS slice_5/VSS slice_6/VSS slice_7/VSS slice_8/VSS slice_9/VSS slice_10/VSS slice_11/VSS slice_12/VSS slice_13/VSS slice_14/VSS slice_15/VSS slice_16/VSS slice_17/VSS slice_18/VSS slice_19/VSS slice_20/VSS slice_21/VSS slice_22/VSS slice_23/VSS slice_24/VSS slice_25/VSS slice_26/VSS slice_27/VSS slice_28/VSS slice_29/VSS slice_30/VSS slice_31/VSS]
connect_supply_net VSS -ports {snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_0__0_ISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_wrISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_1_ISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_2_ISO_SIPO_OUT/VSS CLK_UPF_LS/VSS EN_UPF_LS/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_wr_0_ISO_SIPO_OUT/VSS snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_doutISO_PISO_OUT/VSS snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_dout_0_ISO_PISO_OUT/VSS EN_1_UPF_LS/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_1__0_ISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_0_ISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_3__0_ISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_3_ISO_SIPO_OUT/VSS snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_2__0_ISO_SIPO_OUT/VSS snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_scan_out5ISO_PISO_OUT/VSS lreset_sync/CLK_UPF_LS/VSS}
connect_supply_net VSS -ports {sipo_slice_first/sin_UPF_LS/VSS sipo_slice_first/scan_in1_UPF_LS/VSS sipo_slice_first/reset_UPF_LS/VSS sipo_slice_first/scan_enable_UPF_LS/VSS sipo_slice_last/sin_UPF_LS/VSS sipo_slice_last/scan_enable_UPF_LS/VSS sipo_slice_last/reset_UPF_LS/VSS piso_slice_first/load_UPF_LS/VSS piso_slice_first/reset_UPF_LS/VSS piso_slice_first/scan_enable_UPF_LS/VSS piso_slice_last/load_UPF_LS/VSS piso_slice_last/reset_UPF_LS/VSS piso_slice_last/scan_enable_UPF_LS/VSS}
connect_supply_net VDDL -ports [list VDDL slice_0/VDDL slice_1/VDDL slice_2/VDDL slice_3/VDDL slice_4/VDDL slice_5/VDDL slice_6/VDDL slice_7/VDDL slice_8/VDDL slice_9/VDDL slice_10/VDDL slice_11/VDDL slice_12/VDDL slice_13/VDDL slice_14/VDDL slice_15/VDDL slice_16/VDDL slice_17/VDDL slice_18/VDDL slice_19/VDDL slice_20/VDDL slice_21/VDDL slice_22/VDDL slice_23/VDDL slice_24/VDDL slice_25/VDDL slice_26/VDDL slice_27/VDDL slice_28/VDDL slice_29/VDDL slice_30/VDDL slice_31/VDDL]
connect_supply_net VDDL -ports {CLK_UPF_LS/VDDL EN_UPF_LS/VDDL EN_1_UPF_LS/VDDL lreset_sync/CLK_UPF_LS/VDDL}
connect_supply_net VDDH -ports [list VDDH slice_0/VDDH slice_1/VDDH slice_2/VDDH slice_3/VDDH slice_4/VDDH slice_5/VDDH slice_6/VDDH slice_7/VDDH slice_8/VDDH slice_9/VDDH slice_10/VDDH slice_11/VDDH slice_12/VDDH slice_13/VDDH slice_14/VDDH slice_15/VDDH slice_16/VDDH slice_17/VDDH slice_18/VDDH slice_19/VDDH slice_20/VDDH slice_21/VDDH slice_22/VDDH slice_23/VDDH slice_24/VDDH slice_25/VDDH slice_26/VDDH slice_27/VDDH slice_28/VDDH slice_29/VDDH slice_30/VDDH slice_31/VDDH]
connect_supply_net VDDH -ports {snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_0__0_ISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_wrISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_1_ISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_2_ISO_SIPO_OUT/VDDH CLK_UPF_LS/VDDH EN_UPF_LS/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_wr_0_ISO_SIPO_OUT/VDDH snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_doutISO_PISO_OUT/VDDH snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_dout_0_ISO_PISO_OUT/VDDH EN_1_UPF_LS/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_1__0_ISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_0_ISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_3__0_ISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_3_ISO_SIPO_OUT/VDDH snps_PD_SIPO_SLICE__ISO_SIPO_OUT_snps_addr_2__0_ISO_SIPO_OUT/VDDH snps_PD_PISO_SLICE__ISO_PISO_OUT_snps_scan_out5ISO_PISO_OUT/VDDH lreset_sync/CLK_UPF_LS/VDDH}
connect_supply_net VDDM -ports [list VDDM slice_0/VDDM slice_1/VDDM slice_2/VDDM slice_3/VDDM slice_4/VDDM slice_5/VDDM slice_6/VDDM slice_7/VDDM slice_8/VDDM slice_9/VDDM slice_10/VDDM slice_11/VDDM slice_12/VDDM slice_13/VDDM slice_14/VDDM slice_15/VDDM slice_16/VDDM slice_17/VDDM slice_18/VDDM slice_19/VDDM slice_20/VDDM slice_21/VDDM slice_22/VDDM slice_23/VDDM slice_24/VDDM slice_25/VDDM slice_26/VDDM slice_27/VDDM slice_28/VDDM slice_29/VDDM slice_30/VDDM slice_31/VDDM]
create_power_switch SW_SIPO_SLICE -domain PD_SIPO_SLICE -output_supply_port {out SSL_SIPO_SLICE_SW.power} -input_supply_port {in VDDL} -control_port {shut_down_signal_SIPO_SLICE shut_down_signals[0]} -on_state {TOP_ON in {!shut_down_signal_SIPO_SLICE}} -ack_port {ack_signal_SIPO_SLICE PG_ack_signals[2] {shut_down_signal_SIPO_SLICE}} -ack_delay {ack_signal_SIPO_SLICE 10}
map_power_switch SW_SIPO_SLICE -domain PD_SIPO_SLICE -lib_cells {HEAD2X16_HVT HEAD2X2_HVT HEAD2X32_HVT HEAD2X4_HVT HEAD2X8_HVT HEAD2X16_RVT HEAD2X2_RVT HEAD2X32_RVT HEAD2X4_RVT HEAD2X8_RVT HEAD2X16_LVT HEAD2X2_LVT HEAD2X32_LVT HEAD2X4_LVT HEAD2X8_LVT}
create_power_switch SW_PISO_SLICE -domain PD_PISO_SLICE -output_supply_port {out SSL_PISO_SLICE_SW.power} -input_supply_port {in VDDL} -control_port {shut_down_signal_PISO_SLICE shut_down_signals[1]} -on_state {TOP_ON in {!shut_down_signal_PISO_SLICE}} -ack_port {ack_signal_PISO_SLICE PG_ack_signals[3] {shut_down_signal_PISO_SLICE}} -ack_delay {ack_signal_PISO_SLICE 10}
map_power_switch SW_PISO_SLICE -domain PD_PISO_SLICE -lib_cells {HEAD2X16_HVT HEAD2X2_HVT HEAD2X32_HVT HEAD2X4_HVT HEAD2X8_HVT HEAD2X16_RVT HEAD2X2_RVT HEAD2X32_RVT HEAD2X4_RVT HEAD2X8_RVT HEAD2X16_LVT HEAD2X2_LVT HEAD2X32_LVT HEAD2X4_LVT HEAD2X8_LVT}
add_port_state piso_sw_out -state {SSL_PISO_SLICE_ON 0.780000}
add_port_state piso_sw_out -state {SSL_PISO_SLICE_OFF off}
add_port_state sipo_sw_out -state {SSL_SIPO_SLICE_ON 0.780000}
add_port_state sipo_sw_out -state {SSL_SIPO_SLICE_OFF off}
create_pst BIT_TOP_PST -supplies [list SS.power VDDL SSL_SIPO_SLICE_SW.power SSL_PISO_SLICE_SW.power VDDM SS.ground]
add_pst_state ALL_ON -pst BIT_TOP_PST -state {SS_ON SSL_ON SSL_SIPO_SLICE_ON SSL_PISO_SLICE_ON MEM_ON GND}
add_pst_state PISO_SLICE_ON -pst BIT_TOP_PST -state {SS_ON SSL_ON SSL_SIPO_SLICE_OFF SSL_PISO_SLICE_ON MEM_ON GND}
add_pst_state SIPO_SLICE_ON -pst BIT_TOP_PST -state {SS_ON SSL_ON SSL_SIPO_SLICE_ON SSL_PISO_SLICE_OFF MEM_ON GND}
add_pst_state SIPO_PISO_SLICE_OFF -pst BIT_TOP_PST -state {SS_ON SSL_ON SSL_SIPO_SLICE_OFF SSL_PISO_SLICE_OFF MEM_ON GND}
set_isolation ISO_SIPO_OUT -domain PD_SIPO_SLICE -isolation_supply_set SS -name_suffix ISO_SIPO_OUT -clamp_value 1 -sink SS 
set_isolation_control ISO_SIPO_OUT -domain PD_SIPO_SLICE -isolation_signal {isolation_signals[0]} -isolation_sense high -location parent
set_isolation ISO_PPP -domain PD_SIPO_SLICE -isolation_supply_set SSL -clamp_value 1 -source SSL_PISO_SLICE_SW -sink SSL_SIPO_SLICE_SW 
set_isolation_control ISO_PPP -domain PD_SIPO_SLICE -isolation_signal {isolation_signals[0]} -isolation_sense high -location parent
set_isolation ISO_PISO_OUT -domain PD_PISO_SLICE -isolation_supply_set SS -name_suffix ISO_PISO_OUT -clamp_value 1 -sink SS 
set_isolation_control ISO_PISO_OUT -domain PD_PISO_SLICE -isolation_signal {isolation_signals[1]} -isolation_sense high -location parent
set_port_attributes -ports {hclk} -driver_supply SS
set_port_attributes -ports {lclk data_valid shut_down_signals[1] shut_down_signals[0] isolation_signals[1] isolation_signals[0] retention_signals[1] retention_signals[0]} -driver_supply SSL
set_port_attributes -ports {slice_31/sipo_scan_in slice_31/piso_scan_in slice_31/hv_scan_in slice_31/lv_scan_in slice_30/sipo_scan_in slice_30/piso_scan_in slice_30/hv_scan_in slice_30/lv_scan_in slice_29/sipo_scan_in slice_29/piso_scan_in slice_29/hv_scan_in slice_29/lv_scan_in slice_28/sipo_scan_in slice_28/piso_scan_in slice_28/hv_scan_in slice_28/lv_scan_in slice_27/sipo_scan_in slice_27/piso_scan_in slice_27/hv_scan_in slice_27/lv_scan_in slice_26/sipo_scan_in slice_26/piso_scan_in slice_26/hv_scan_in slice_26/lv_scan_in slice_25/sipo_scan_in slice_25/piso_scan_in slice_25/hv_scan_in slice_25/lv_scan_in slice_24/sipo_scan_in slice_24/piso_scan_in slice_24/hv_scan_in slice_24/lv_scan_in slice_23/sipo_scan_in slice_23/piso_scan_in slice_23/hv_scan_in slice_23/lv_scan_in slice_22/sipo_scan_in slice_22/piso_scan_in slice_22/hv_scan_in slice_22/lv_scan_in slice_21/sipo_scan_in slice_21/piso_scan_in slice_21/hv_scan_in slice_21/lv_scan_in slice_20/sipo_scan_in slice_20/piso_scan_in slice_20/hv_scan_in slice_20/lv_scan_in slice_19/sipo_scan_in slice_19/piso_scan_in slice_19/hv_scan_in slice_19/lv_scan_in slice_18/sipo_scan_in slice_18/piso_scan_in slice_18/hv_scan_in slice_18/lv_scan_in slice_17/sipo_scan_in slice_17/piso_scan_in slice_17/hv_scan_in slice_17/lv_scan_in slice_16/sipo_scan_in slice_16/piso_scan_in slice_16/hv_scan_in slice_16/lv_scan_in slice_15/sipo_scan_in slice_15/piso_scan_in slice_15/hv_scan_in slice_15/lv_scan_in slice_14/sipo_scan_in slice_14/piso_scan_in slice_14/hv_scan_in slice_14/lv_scan_in slice_13/sipo_scan_in slice_13/piso_scan_in slice_13/hv_scan_in slice_13/lv_scan_in slice_12/sipo_scan_in slice_12/piso_scan_in slice_12/hv_scan_in slice_12/lv_scan_in slice_11/sipo_scan_in slice_11/piso_scan_in slice_11/hv_scan_in slice_11/lv_scan_in slice_10/sipo_scan_in slice_10/piso_scan_in slice_10/hv_scan_in slice_10/lv_scan_in slice_9/sipo_scan_in slice_9/piso_scan_in slice_9/hv_scan_in slice_9/lv_scan_in slice_8/sipo_scan_in slice_8/piso_scan_in slice_8/hv_scan_in slice_8/lv_scan_in slice_7/sipo_scan_in slice_7/piso_scan_in slice_7/hv_scan_in slice_7/lv_scan_in slice_6/sipo_scan_in slice_6/piso_scan_in slice_6/hv_scan_in slice_6/lv_scan_in slice_5/sipo_scan_in slice_5/piso_scan_in slice_5/hv_scan_in slice_5/lv_scan_in slice_4/sipo_scan_in slice_4/piso_scan_in slice_4/hv_scan_in slice_4/lv_scan_in slice_3/sipo_scan_in slice_3/piso_scan_in slice_3/hv_scan_in slice_3/lv_scan_in slice_2/sipo_scan_in slice_2/piso_scan_in slice_2/hv_scan_in slice_2/lv_scan_in slice_1/sipo_scan_in slice_1/piso_scan_in slice_1/hv_scan_in slice_1/lv_scan_in slice_0/sipo_scan_in slice_0/piso_scan_in slice_0/hv_scan_in slice_0/lv_scan_in} -repeater_supply SS
set_retention RET_SIPO_SLICE -domain PD_SIPO_SLICE -retention_supply_set SSL 
set_retention_control RET_SIPO_SLICE -domain PD_SIPO_SLICE -save_signal {retention_signals[0] high} -restore_signal {retention_signals[0] low}
map_retention_cell RET_SIPO_SLICE -domain PD_SIPO_SLICE -lib_cells {RSDFFARX1_HVT RSDFFARX2_HVT RSDFFARX1_RVT RSDFFARX2_RVT RSDFFARX1_LVT RSDFFARX2_LVT }
set_retention RET_PISO_SLICE -domain PD_PISO_SLICE -retention_supply_set SSL 
set_retention_control RET_PISO_SLICE -domain PD_PISO_SLICE -save_signal {retention_signals[1] high} -restore_signal {retention_signals[1] low}
map_retention_cell RET_PISO_SLICE -domain PD_PISO_SLICE -lib_cells {RSDFFARX1_HVT RSDFFARX2_HVT RSDFFARX1_RVT RSDFFARX2_RVT RSDFFARX1_LVT RSDFFARX2_LVT }
