################################################################################
##
##  This confidential and proprietary software may be used only
##  as authorized by a licensing agreement from Synopsys Inc.
##  In the event of publication, the following notice is applicable:
##
##  (C) COPYRIGHT 1994 - 2017 SYNOPSYS INC.
##  ALL RIGHTS RESERVED
##
##  The entire notice above must be reproduced on all authorized copies.
##
##  AUTHOR:    Godwin Maben
##
##  FILE:      snps_bit_slice.upf
##
##  VERSION:   1.0
##
################################################################################

# UPF DIRECTORY
set UPF_DIR ../../upf

# UPF 2.1 FOR PST
set_design_attributes -elements {.} -attribute enable_state_propagation_in_add_power_state true

# SUPPLY SETS (EXPLICIT)
create_supply_set SS
create_supply_set SSL -function {ground SS.ground}
create_supply_set SSL_SIPO_SW -function { ground SS.ground}
create_supply_set SSL_PISO_SW -function { ground SS.ground}
create_supply_set SS_MEM_SW -function {ground SS.ground}

# POWER DOMAINS
create_power_domain TOP -supply {primary SS} -include_scope
create_power_domain PD_SIPO -supply {primary SSL_SIPO_SW} -elements {sipo_bit}
create_power_domain PD_PISO -supply {primary SSL_PISO_SW} -elements {piso_bit}

# POWER SWITCHES
create_power_switch -domain PD_SIPO \
                    -output_supply_port {out SSL_SIPO_SW.power} \
                    -input_supply_port {in SSL.power} \
                    -control_port {shut_down_signal_SIPO shut_down_signals[0] } \
                    -on_state {TOP_ON in !shut_down_signal_SIPO} \
                    -ack_port {ack_signal_SIPO PG_ack_signals[0] {shut_down_signal_SIPO}} -ack_delay {ack_signal_SIPO 10} PD1_SW

create_power_switch -domain PD_PISO \
                    -output_supply_port {out SSL_PISO_SW.power} \
                    -input_supply_port {in SSL.power} \
                    -control_port {shut_down_signal_PISO shut_down_signals[1] } \
                    -on_state {TOP_ON in !shut_down_signal_PISO} \
                    -ack_port {ack_signal_PISO PG_ack_signals[1] {shut_down_signal_PISO}} -ack_delay {ack_signal_PISO 10} PD2_SW

map_power_switch -domain PD_SIPO -lib_cells {HEAD2X*} PD1_SW
map_power_switch -domain PD_PISO -lib_cells {HEAD2X*} PD2_SW

# RETENTION
set_retention -domain PD_SIPO -retention_supply_set SSL RET_SIPO
set_retention_control -domain PD_SIPO -save_signal {retention_signals[0] high} -restore_signal {retention_signals[0] low} RET_SIPO

set_retention -domain PD_PISO -retention_supply_set SSL RET_PISO
set_retention_control -domain PD_PISO -save_signal {retention_signals[1] high} -restore_signal {retention_signals[1] low} RET_PISO

map_retention_cell -domain PD_SIPO -lib_cells {RSDFFAR*} RET_SIPO
map_retention_cell -domain PD_PISO -lib_cells {RSDFFAR*} RET_PISO

# ISOLATION
set_isolation -domain PD_SIPO -sink SS -isolation_supply_set SS -clamp_value 1 ISO_SIPO_OUT -name_suffix ISO_SIPO_OUT
set_isolation_control -domain PD_SIPO -isolation_sense high -isolation_signal isolation_signals[0] -location parent ISO_SIPO_OUT

set_isolation -domain PD_SIPO -sink SS_MEM_SW -isolation_supply_set SS -clamp_value 1 ISO_SIPO2MEM_OUT -name_suffix ISO_SIPO2MEM_OUT
set_isolation_control -domain PD_SIPO -isolation_sense high -isolation_signal isolation_signals[0] -location parent ISO_SIPO2MEM_OUT

set_isolation -domain PD_SIPO -sink SS_MEM_SW -isolation_supply_set SS -clamp_value 1 -elements {sipo_bit/wr} ISO_SIPO2MEM_OUT1 -name_suffix ISO_SIPO2MEM_OUT1
set_isolation_control -domain PD_SIPO -isolation_sense high -isolation_signal isolation_signals[0] -location fanout ISO_SIPO2MEM_OUT1

set_isolation -domain PD_SIPO -sink SS -isolation_supply_set SS -clamp_value 1 -elements {sipo_bit/wr} ISO_SIPO2MEM_OUT2 -name_suffix ISO_SIPO2MEM_OUT2
set_isolation_control -domain PD_SIPO -isolation_sense high -isolation_signal isolation_signals[0] -location fanout ISO_SIPO2MEM_OUT2

set_isolation -domain PD_PISO -sink SS -isolation_supply_set SS -clamp_value 1 ISO_PISO_OUT -name_suffix ISO_PISO_OUT
set_isolation_control -domain PD_PISO -isolation_sense high -isolation_signal isolation_signals[1] -location parent ISO_PISO_OUT

set_isolation -domain TOP -source SS_MEM_SW -isolation_supply_set SS -clamp_value 1 ISO_TOP2_MEM -name_suffix ISO_TOP2_MEM
set_isolation_control -domain TOP -isolation_sense high -isolation_signal isolation_signals[1] -location self ISO_TOP2_MEM

set_isolation -domain PD_PISO -isolation_supply_set SSL -clamp_value 0 -elements {piso_bit/dout} ISO_PISO_OUT_SSL -name_suffix ISO_PISO_OUT_SSL
set_isolation_control -domain PD_PISO -isolation_sense high -isolation_signal isolation_signals[1] -location self ISO_PISO_OUT_SSL

map_isolation_cell -domain PD_PISO -lib_cells {ISO*NOR*} ISO_PISO_OUT_SSL

# POWER STATE TABLE (UPF 2.1)
add_power_state -supply SS          -state SS_ON        {-supply_expr {power ==  {FULL_ON 0.85} }}
add_power_state -supply SS          -state GND          {-supply_expr {ground == {FULL_ON 0.0} }} 
add_power_state -supply SSL         -state SSL_ON       {-supply_expr {power ==  {FULL_ON 0.78} }}
add_power_state -supply SSL_SIPO_SW -state SSL_SIPO_ON  {-supply_expr {power ==  {FULL_ON 0.78} }}
add_power_state -supply SSL_SIPO_SW -state SSL_SIPO_OFF {-supply_expr {power ==  {OFF}} -simstate CORRUPT} 
add_power_state -supply SSL_PISO_SW -state SSL_PISO_ON  {-supply_expr {power ==  {FULL_ON 0.78} }}
add_power_state -supply SSL_PISO_SW -state SSL_PISO_OFF {-supply_expr {power ==  {OFF}} -simstate CORRUPT} 
add_power_state -supply SS_MEM_SW   -state MEM_ON       {-supply_expr {power ==  {FULL_ON 0.85} }}
add_power_state -supply SS_MEM_SW   -state MEM_OFF      {-supply_expr {power ==  {OFF}} -simstate CORRUPT} 

create_pst BIT_SLICE_PST -supplies                    {SS.power SSL.power SSL_SIPO_SW.power SSL_PISO_SW.power SS_MEM_SW.power SS.ground}
add_pst_state ALL_ON        -pst BIT_SLICE_PST -state {SS_ON    SSL_ON    SSL_SIPO_ON       SSL_PISO_ON       MEM_ON          GND}
add_pst_state PISO_ON       -pst BIT_SLICE_PST -state {SS_ON    SSL_ON    SSL_SIPO_OFF      SSL_PISO_ON       MEM_ON          GND}
add_pst_state SIPO_ON       -pst BIT_SLICE_PST -state {SS_ON    SSL_ON    SSL_SIPO_ON       SSL_PISO_OFF      MEM_ON          GND}
add_pst_state SIPO_PISO_OFF -pst BIT_SLICE_PST -state {SS_ON    SSL_ON    SSL_SIPO_OFF      SSL_PISO_OFF      MEM_ON          GND}

# SUPPLY NETS FOR INTERNAL MEMORIES 
connect_supply_net SS_MEM_SW.power -ports nibble_0/VDDG
connect_supply_net SS_MEM_SW.power -ports nibble_1/VDDG

connect_supply_net SS.power -ports nibble_0/VDD
connect_supply_net SS.ground -ports nibble_0/VSS

connect_supply_net SS.power -ports nibble_1/VDD
connect_supply_net SS.ground -ports nibble_1/VSS

# REFINE PG
#load_upf $UPF_DIR/refine_bs.upf

# PORT ATTRIBUTES
set_port_attributes -ports retention_signals -driver_supply SSL
set_port_attributes -ports isolation_signals -driver_supply SSL
set_port_attributes -ports sin  -driver_supply SSL
set_port_attributes -ports lclk  -driver_supply SSL
set_port_attributes -ports hclk  -driver_supply SS
set_port_attributes -ports data_valid -driver_supply SSL
set_port_attributes -ports shut_down_signals  -driver_supply SSL
set_port_attributes -ports sout -receiver_supply SSL
